<?php
// 1 задание
$i = 1;
while($i < 100){
    if($i % 3 == 0){
        echo $i.'<br>';
    };
    $i++;
};


// 2 задание
$i = 0;
do{
    if($i == 0){
        echo $i.' - это ноль<br>';
    }
    elseif($i % 2 == 0){
        echo $i.' – чётное число<br>';
    }
    else{
        echo $i.' – нечётное число<br>';
    };
    $i++;
}while($i < 11);


// 3 задание
$area = array('Московская область'=>'Москва, Зеленоград, Клин', 'Ленинградская область'=>'Санкт-Петербург, Всеволожск, Павловск, Кронштадт', 'Рязанская Область' => 'Касимов, Кораблино, Михайлов, Новомичуринск, Рыбное, Ряжск, Рязань, Сасово, Скопин, Спас-Клепики, Спасск-Рязанский, Шацк');
foreach($area as $key => $value){
    echo ($key.': <br>'.$value.'<br><br>');
};


// 4, 5, 9 задания
$text = 'задача организации, в особенности же консультация';
$letter = array(
    ' ' => '_', 'а' => 'a','б' => 'b','в' => 'v', 
    'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'yo', 'ж' => 'zh',
    'з' => 'z', 'и' => 'i', 'й' => 'y', 'k' => 'k', 
    'л' => 'l', 'м' => 'm', 'н' => 'n', 'o' => 'o',
    'п' => 'p', 'р' => 'r', 'с' => 's', 'т' => 't',
    'у' => 'u', 'ф' => 'f', 'х' => 'kh', 'ц' => 'ts',
    'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shch', 'ъ' => '»',
    'ы' => 'y', 'ь' => '‘', 'э' => 'e', 'ю' => 'yu',
    'я' => 'ya');
trans($text, $letter);
function trans($text, $letter){
    foreach($letter as $key => $value){
        $text = str_replace($key, $value, $text);
    };
    echo $text;
};
echo '<br>';


// 7 задание
for ($i = 1; $i <= 10; print $i, $i++);

?>

